// SPDX-FileCopyrightText: 2021 Kent Gibson <warthog618@gmail.com>
//
// SPDX-License-Identifier: Apache-2.0 OR MIT

use bitflags::bitflags;
use bitmaps::Bitmap;
use std::convert::TryFrom;
use std::fmt;
use std::fs::File;
use std::mem;
use std::os::unix::prelude::{FromRawFd, RawFd};
use std::time::Duration;

use super::common::{ValidationResult, IOCTL_MAGIC};

// common to ABI v1 and v2.
pub use super::common::{
    get_chip_info, unwatch_line_info, ChipInfo, LineEdgeEventKind, LineInfoChangeKind, Offset,
    Offsets, Padding, UnderReadError, ValidationError,
};
use super::{Error, Name, Result};

#[repr(u8)]
enum Ioctl {
    GetLineInfo = 5,
    WatchLineInfo = 6,
    GetLine = 7,
    SetLineConfig = 0xD,
    GetLineValues = 0xE,
    SetLineValues = 0xF,
}

bitflags! {
    /// Flags indicating the configuration of a line.
    #[derive(Clone, Copy, Debug, Default, Eq, Hash, PartialEq)]
    pub struct LineFlags: u64 {
        /// The line is in use and is not available for request.
        const USED = 1;

        /// The line active state corresponds to a physical low.
        const ACTIVE_LOW = 2;

        /// The line is an input.
        const INPUT = 4;

        /// The line is an output.
        const OUTPUT = 8;

        /// The line detects rising (*inactive* to *active*) edges.
        const EDGE_RISING = 16;

        /// The line detects falling (*active* to *inactive*) edges.
        const EDGE_FALLING = 32;

        /// The line is an open drain output.

                "LineInfoChangeEvent",
                mem::size_of::<LineInfoChangeEvent>(),
                len,
            )));
        }
        // SAFETY: returned struct is explicitly validated before being returned.
        let ice = unsafe { &*(d as *const [u64] as *const LineInfoChangeEvent) };
        ice.validate().map(|_| ice).map_err(Error::from)
    }

    /// Check that a LineInfoChangeEvent read from the kernel is valid in Rust.
    fn validate(&self) -> ValidationResult {
        self.kind
            .validate()
            .map_err(|e| ValidationError::new("kind", e))
    }
}

/// Information about an edge event on a requested line.
#[repr(C)]
#[derive(Clone, Debug, Eq, PartialEq)]
pub struct LineEdgeEvent {
    /// The best estimate of time of event occurrence, in nanoseconds.
    ///
    /// By default the timestamp is read from **CLOCK_MONOTONIC** and is
    /// intended to allow the accurate measurement of the time between events.
    /// It does not provide the wall-clock time.
    ///
    /// If the [`LineFlags::EVENT_CLOCK_REALTIME`] flag is set then the
    /// timestamp is read from **CLOCK_REALTIME**.
    pub timestamp_ns: u64,

    /// The event trigger identifier.
    pub kind: LineEdgeEventKind,

    /// The offset of the line that triggered the event.
    pub offset: Offset,

    /// The sequence number for this event in the sequence of events for all
    /// the lines in this line request.
    pub seqno: u32,

    /// The sequence number for this event in the sequence of events on this
    /// particular line.
    pub line_seqno: u32,

    /// Reserved for future use.
    #[doc(hidden)]
    pub padding: Padding<6>,
}

impl LineEdgeEvent {
    /// Read an edge event from a buffer.
    ///
    /// The buffer is assumed to have been populated by a read of the line request File,
    /// so the content is validated before being returned.
    pub fn from_slice(d: &[u64]) -> Result<&LineEdgeEvent> {
        debug_assert!(mem::size_of::<LineEdgeEvent>() % 8 == 0);
        let len = d.len() * 8;
        if len < mem::size_of::<LineEdgeEvent>() {
            return Err(Error::from(UnderReadError::new(
                "LineEdgeEvent",
                mem::size_of::<LineEdgeEvent>(),
                len,
            )));
        }
        // SAFETY: returned struct is explicitly validated before being returned.
        let le = unsafe { &*(d as *const [u64] as *const LineEdgeEvent) };
        le.validate().map(|_| le).map_err(Error::from)
    }

    /// Check that a LineEdgeEvent read from the kernel is valid in Rust.
    fn validate(&self) -> ValidationResult {
        self.kind
            .validate()
            .map_err(|e| ValidationError::new("kind", e))
    }
}

#[cfg(test)]
mod tests {
    use super::*;

    mod line_attribute {
        use super::LineAttribute;

        #[test]
        fn size() {
            assert_eq!(
                super::mem::size_of::<LineAttribute>(),
                16usize,
                concat!("Size of: ", stringify!(LineAttribute))
            );
        }
    }

    mod line_attribute_value_union {
        use super::LineAttributeValueUnion;

        #[test]
        fn size() {
            assert_eq!(
                super::mem::size_of::<LineAttributeValueUnion>(),
                8usize,
                concat!("Size of: ", stringify!(LineAttributeValueUnion))
            );
        }
    }

    mod line_config_attribute {
        use super::LineConfigAttribute;

        #[test]
        fn line_config_attribute() {
            assert_eq!(
                super::mem::size_of::<LineConfigAttribute>(),
                24usize,
                concat!("Size of: ", stringify!(LineConfigAttribute))
            );
        }
    }

    mod line_config {
        use super::LineConfig;

        #[test]
        fn line_config() {
            assert_eq!(
                super::mem::size_of::<LineConfig>(),
                272usize,
                concat!("Size of: ", stringify!(LineConfig))
            );
        }
    }

    mod line_request {
        use super::LineRequest;

        #[test]
        fn line_request() {
            assert_eq!(
                super::mem::size_of::<LineRequest>(),
                592usize,
                concat!("Size of: ", stringify!(LineRequest))
            );
        }
    }

    mod line_values {
        use super::{Bitmap, LineValues};

        #[test]
        fn get() {
            let mut a = LineValues::default();
            for idx in [0, 2] {
                assert!(!a.bits.get(idx), "idx: {}", idx);
                assert!(a.get(idx).is_none(), "idx: {}", idx);

                a.mask.set(idx, true);
                assert!(!a.get(idx).unwrap(), "idx: {}", idx);

                a.bits.set(idx, true);
                assert!(a.get(idx).unwrap(), "idx: {}", idx);
            }
        }

        #[test]
        fn set() {
            let mut a = LineValues::default();
            for idx in [0, 2] {
                a.set(idx, false);
                assert!(a.mask.get(idx), "idx: {}", idx);
                assert!(!a.bits.get(idx), "idx: {}", idx);

                a.set(idx, true);
                assert!(a.mask.get(idx), "idx: {}", idx);
                assert!(a.bits.get(idx), "idx: {}", idx);
            }
        }

        #[test]
        fn unset_mask() {
            let mut a = LineValues {
                mask: Bitmap::mask(6),
                ..Default::default()
            };
            assert_eq!(a.mask.len(), 6);
            assert!(a.mask.get(0));

            a.unset_mask(0);
            assert!(!a.mask.get(0));
            assert_eq!(a.mask.len(), 5);
            assert!(a.mask.get(3));

            a.unset_mask(3);
            assert!(!a.mask.get(3));
            assert_eq!(a.mask.len(), 4);
            assert!(a.mask.get(5));

            a.unset_mask(5);
            assert!(!a.mask.get(5));
            assert_eq!(a.mask.len(), 3);
            assert!(!a.mask.get(6));

            a.unset_mask(5);
            assert!(!a.mask.get(5));
            assert_eq!(a.mask.len(), 3);
        }

        #[test]
        fn size() {
            assert_eq!(
                super::mem::size_of::<LineValues>(),
                16usize,
                concat!("Size of: ", stringify!(LineValues))
            );
        }
    }

    mod line_attribute_kind {
        use super::LineAttributeKind;

        #[test]
        fn validate() {
            let mut a = LineAttributeKind::Flags;
            assert!(a.validate().is_ok());

            a = LineAttributeKind::Unused;
            assert!(a.validate().is_ok());

            unsafe {
                a = *(&4 as *const i32 as *const LineAttributeKind);
                assert_eq!(a.validate().unwrap_err(), "invalid value: 4");
                a = *(&3 as *const i32 as *const LineAttributeKind);
                assert!(a.validate().is_ok());
            }
        }
    }

    mod line_info {
        use super::{LineAttributeKind, LineInfo, NUM_ATTRS_MAX};

        #[test]
        fn validate() {
            let mut a = LineInfo::default();
            assert!(a.validate().is_ok());

            a.num_attrs = NUM_ATTRS_MAX as u32;
            assert!(a.validate().is_ok());

            a.num_attrs += 1;
            let e = a.validate().unwrap_err();
            assert_eq!(e.field, "num_attrs");
            assert_eq!(e.msg, "out of range: 11");

            a.num_attrs = NUM_ATTRS_MAX as u32;
            for idx in [0, 1, 4, 7] {
                unsafe {
                    a.attrs.0[idx].kind = *(&4 as *const i32 as *const LineAttributeKind);
                }
                let e = a.validate().unwrap_err();
                assert_eq!(e.field, format!("attrs[{}].kind", idx));
                assert_eq!(e.msg, "invalid value: 4");
                a.attrs.0[idx].kind = LineAttributeKind::Unused;
            }
        }

        #[test]
        fn size() {
            assert_eq!(
                super::mem::size_of::<LineInfo>(),
                256usize,
                concat!("Size of: ", stringify!(LineInfo))
            );
        }
    }

    mod line_info_changed {
        use super::{LineInfoChangeEvent, LineInfoChangeKind};

        #[test]
        fn validate() {
            let mut a = LineInfoChangeEvent {
                info: Default::default(),
                timestamp_ns: 0,
                kind: LineInfoChangeKind::Released,
                padding: Default::default(),
            };
            assert!(a.validate().is_ok());

            a.timestamp_ns = 1234;
            assert!(a.validate().is_ok());
            unsafe {
                a.kind = *(&0 as *const i32 as *const LineInfoChangeKind);
                let e = a.validate().unwrap_err();
                assert_eq!(e.field, "kind");
                assert_eq!(e.msg, "invalid value: 0");

                a.kind = *(&4 as *const i32 as *const LineInfoChangeKind);
                let e = a.validate().unwrap_err();
                assert_eq!(e.field, "kind");
                assert_eq!(e.msg, "invalid value: 4");

                a.kind = *(&1 as *const i32 as *const LineInfoChangeKind);
                assert!(a.validate().is_ok());
            }
        }
        #[test]
        fn size() {
            assert_eq!(
                super::mem::size_of::<LineInfoChangeEvent>(),
                288usize,
                concat!("Size of: ", stringify!(LineInfoChangeEvent))
            );
        }
    }

    mod line_event {
        use super::{LineEdgeEvent, LineEdgeEventKind};

        #[test]
        fn validate() {
            let mut a = LineEdgeEvent {
                timestamp_ns: 0,
                kind: LineEdgeEventKind::RisingEdge,
                offset: 0,
                seqno: 0,
                line_seqno: 0,
                padding: Default::default(),
            };
            assert!(a.validate().is_ok());

            a.timestamp_ns = 1234;
            assert!(a.validate().is_ok());
            unsafe {
                a.kind = *(&0 as *const i32 as *const LineEdgeEventKind);
                let e = a.validate().unwrap_err();
                assert_eq!(e.field, "kind");
                assert_eq!(e.msg, "invalid value: 0");

                a.kind = *(&3 as *const i32 as *const LineEdgeEventKind);
                let e = a.validate().unwrap_err();
                assert_eq!(e.field, "kind");
                assert_eq!(e.msg, "invalid value: 3");

                a.kind = *(&1 as *const i32 as *const LineEdgeEventKind);
                assert!(a.validate().is_ok());
            }
        }

        #[test]
        fn size() {
            assert_eq!(
                super::mem::size_of::<LineEdgeEvent>(),
                48usize,
                concat!("Size of: ", stringify!(LineEdgeEvent))
            );
        }
    }
}
